app/controllers/api/v1/geocodes_controller.rb

SELECT "geocodes".* FROM "geocodes" WHERE "geocodes"."latitude" = ? AND "geocodes"."longitude" = ?  [["latitude", 48.3418], ["longitude", 2.21]]
---
  def read

    latitude = '%.3f' % params[:latitude]
    longitude = '%.3f' % params[:longitude]

    # Check if already in DB
    @geocode = Geocode.where(latitude: latitude, longitude: longitude)

INSERT INTO "geocodes" ("latitude", "longitude", "locality", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["latitude", 48.3418], ["longitude", 2.21], ["locality", "rouvres-saint-jean"], ["country", "france"], ["created_at", 2016-03-19 12:26:51 UTC], ["updated_at", 2016-03-19 12:26:51 UTC]]
---
        end
      end

      @geocode = Geocode.create(@geocode)